
&После("УстановкаПараметровСеанса")
Процедура Синий_УстановкаПараметровСеанса(ИменаПараметровСеанса)
	Попытка
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) Тогда
			пвх = ПланыВидовХарактеристик.НастройкиПользователей.НайтиПоНаименованию("СтильОформленияПриложения");
			ИмяСтиля = Пользователи.ПолучитьНастройкуТекущиегоПользователя(пвх);
			Если ИмяСтиля <> неопределено Тогда
				стильОП = БиблиотекаСтилей[ИмяСтиля];
				Если стильОП <> неопределено Тогда
					ГлавныйСтиль = стильОП;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры
